#Вариант 16
"""
Дан словарь на 6 персон, найти и вывести их средний возраст. (Пример, {"Андрей": 32, "Виктор": 29, "Максим": 18, ...}, среднее 26,33). 
"""

persons = {
    "Андрей": 32,
    "Виктор": 29,
    "Максим": 18,
    "Кирилл": 40,
    "Дарья": 60,
    "Данил": 35,
}

mean_age = sum(persons.values()) / len(persons)

print(f"Средний возраст списка: {mean_age:.2f}")

